БПКР/src/Reports/РасчетныеЛистки/РасчетныеЛистки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РасчетныеЛистки</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРасшифровки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВывестиПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

БПКР/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ИспытательныйСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяТрудовогоКодекса</name>
    <type>
      <types>CatalogRef.СтатьиТрудовогоКодекса</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/ФИОФизическихЛиц/ФИОФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

БПКР/src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.КалендариГрафиковРабот</schedule>
  <scheduleValue>InformationRegister.КалендариГрафиковРабот.Resource.ЗначениеДней</scheduleValue>
  <scheduleDate>InformationRegister.КалендариГрафиковРабот.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВидыНачислений</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтражения</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗаработнойПлаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

БПКР/src/CalculationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВидыУдержаний</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерВычета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

БПКР/src/AccumulationRegisters/НалогиПоЗаработнойПлате/НалогиПоЗаработнойПлате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НалогиПоЗаработнойПлате</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНалога</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВидыНалогов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БПКР/src/AccumulationRegisters/ВыплаченнаяЗарплата/ВыплаченнаяЗарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыплаченнаяЗарплата</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВыплаты</name>
    <type>
      <types>EnumRef.ВидыВыплатыЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БПКР/src/InformationRegisters/ДанныеПервичныхДокументов/ДанныеПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПервичныхДокументов</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерРегистратора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.НачисленияПодоходногоНалогаПрочихФизЛиц</types>
      <types>DocumentRef.КорректировкаСтоимостиДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КорректировкаСтоимостиПоступления</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.Доверенность</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОбщийСчетФактураВыписанный</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ГТДПоИмпорту</types>
      <types>DocumentRef.РозничнаяПродажа</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.СчетФактураВыписанный</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДС</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.ДвижениеМБП</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>DocumentRef.ЗакрытиеЗаказовНаПроизводство</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.КорректировкаСтоимостиРеализации</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Enums/ВидыВыплатыЗарплаты/ВидыВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВыплатыЗарплаты</name>
  <enumValues>
    <name>ЧерезКассу</name>
  </enumValues>
  <enumValues>
    <name>ЧерезБанк</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Reports/РасчетныеЛистки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	НастройкиВарианта.Описание = НСтр("ru = 'Расчетные листки.'");
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова = НСтр("ru = 'Расчет'");
КонецПроцедуры

Процедура СформироватьОтчет(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьВыполнить(ПараметрыОтчета, ТабличныйДокумент);
	
	ПоместитьВоВременноеХранилище(ТабличныйДокумент, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Функция формирует и выполняет запрос.
//
Функция ВыполнитьЗапрос(ПараметрыОтчета)
	
	ПериодРегистрации 	= ПараметрыОтчета.ПериодРегистрации;
	Организация 		= ПараметрыОтчета.Организация;
	Подразделение  		= ПараметрыОтчета.Подразделение;	
	Сотрудник 			= ПараметрыОтчета.Сотрудник;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыНачислений.Ссылка КАК ВидРасчета
		|ИЗ
		|	ПланВидовРасчета.ВидыНачислений КАК ВидыНачислений
		|ГДЕ
		|	ВидыНачислений.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаНачислений.Неявка)";
	ВидыРасчетовИсключения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета");
	
	// 1. Сведения о сотруднике, остатки
	// 2. Начисления, удеражания, налоги
	// 3. Выплаты
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	СотрудникиСрезПоследних.ФизЛицо.Код КАК ТабельныйНомер,
		|	СотрудникиСрезПоследних.Подразделение КАК Подразделение,
		|	СотрудникиСрезПоследних.Подразделение.Наименование КАК ПодразделениеПредставление,
		|	СотрудникиСрезПоследних.Должность КАК Должность,
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФИОФизическихЛицСрезПоследних.Фамилия, """") <> """"
		|			ТОГДА ФИОФизическихЛицСрезПоследних.Фамилия + "" "" + ФИОФизическихЛицСрезПоследних.Имя + "" "" + ФИОФизическихЛицСрезПоследних.Отчество
		|		ИНАЧЕ СотрудникиСрезПоследних.ФизЛицо.Наименование
		|	КОНЕЦ КАК СотрудникПредставление,
		|	ЕСТЬNULL(ДолгНаКонец.СуммаОстатокДт, 0) * -1 + ЕСТЬNULL(ДолгНаКонец.СуммаОстатокКт, 0) КАК СальдоНаКонец,
		|	ЕСТЬNULL(ДолгНаНачало.СуммаОстатокДт, 0) * -1 + ЕСТЬNULL(ДолгНаНачало.СуммаОстатокКт, 0) КАК СальдоНаНачало
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И ФизЛицо = &ФизЛицо) КАК СотрудникиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОФизическихЛицСрезПоследних
		|		ПО СотрудникиСрезПоследних.ФизЛицо = ФИОФизическихЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
		|				&НачалоПериода,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленнаяЗаработнаяПлата),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СотрудникиОрганизаций),
		|				Организация = &Организация
		|					И Субконто1 = &ФизЛицо) КАК ДолгНаНачало
		|		ПО СотрудникиСрезПоследних.Организация = ДолгНаНачало.Организация
		|			И СотрудникиСрезПоследних.ФизЛицо = ДолгНаНачало.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
		|				ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1),
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленнаяЗаработнаяПлата),
		|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СотрудникиОрганизаций),
		|				Организация = &Организация
		|					И Субконто1 = &ФизЛицо) КАК ДолгНаКонец
		|		ПО СотрудникиСрезПоследних.Организация = ДолгНаКонец.Организация
		|			И СотрудникиСрезПоследних.ФизЛицо = ДолгНаКонец.Субконто1
		|ГДЕ
		|	СотрудникиСрезПоследних.Подразделение В ИЕРАРХИИ(&Подразделение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеПредставление,
		|	СотрудникПредставление
		|ИТОГИ
		|	МАКСИМУМ(ПодразделениеПредставление),
		|	МАКСИМУМ(Должность),
		|	МАКСИМУМ(Фамилия),
		|	МАКСИМУМ(Имя),
		|	МАКСИМУМ(Отчество),
		|	МАКСИМУМ(СальдоНаКонец),
		|	МАКСИМУМ(СальдоНаНачало)
		|ПО
		|	Подразделение,
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.ФизЛицо КАК ФизЛицо,
		|	Начисления.ВидРасчета КАК Начисление,
		|	NULL КАК Удержание,
		|	Начисления.ОтработаноДней КАК ОтработаноДней,
		|	Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
		|	Начисления.Размер КАК Размер,
		|	ВЫБОР
		|		КОГДА Начисления.ВидРасчета.ДополнительныйДоход
		|			ТОГДА 0
		|		ИНАЧЕ Начисления.Результат
		|	КОНЕЦ КАК СуммаНачислено,
		|	ВЫБОР
		|		КОГДА Начисления.ВидРасчета.ДополнительныйДоход
		|			ТОГДА Начисления.Результат
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Допдоход,
		|	0 КАК СуммаУдержано,
		|	Начисления.ПериодДействияНачало КАК ДатаНачала,
		|	Начисления.ПериодДействияКонец КАК ДатаОкончания
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Начисления.Организация = &Организация
		|	И Начисления.ФизЛицо = &ФизЛицо
		|	И НЕ Начисления.ВидРасчета В (&ВидыРасчетовИсключения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Удержания.ФизЛицо,
		|	NULL,
		|	Удержания.ВидРасчета,
		|	0,
		|	0,
		|	Удержания.Размер,
		|	0,
		|	0,
		|	Удержания.Результат,
		|	NULL,
		|	Удержания.ПериодРегистрации
		|ИЗ
		|	РегистрРасчета.Удержания КАК Удержания
		|ГДЕ
		|	Удержания.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Удержания.Организация = &Организация
		|	И Удержания.ФизЛицо = &ФизЛицо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НалогиПоЗаработнойПлатеОбороты.ФизЛицо,
		|	NULL,
		|	НалогиПоЗаработнойПлатеОбороты.ВидНалога,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	НалогиПоЗаработнойПлатеОбороты.СуммаОборот,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрНакопления.НалогиПоЗаработнойПлате.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Авто,
		|			Организация = &Организация
		|				И ФизЛицо = &ФизЛицо
		|				И ВидНалога В (ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.ПФР), ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.ГНПФР), ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.ПН), ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.ПрофВзнос))) КАК НалогиПоЗаработнойПлатеОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВыплаченнаяЗарплатаОбороты.ВидВыплаты = ЗНАЧЕНИЕ(Перечисление.ВидыВыплатыЗарплаты.ЧерезКассу)
		|			ТОГДА ""Через кассу ""
		|		ИНАЧЕ ""С расч. счета ""
		|	КОНЕЦ КАК ПредставлениеДокумента,
		|	ВЫБОР
		|		КОГДА ВыплаченнаяЗарплатаОбороты.ПериодРегистрации = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПризнакАванса,
		|	ДанныеПервичныхДокументов.Номер КАК Номер,
		|	ДанныеПервичныхДокументов.Дата КАК Дата,
		|	ВыплаченнаяЗарплатаОбороты.ПериодРегистрации КАК ПериодРегистрации,
		|	ВыплаченнаяЗарплатаОбороты.Регистратор КАК Регистратор,
		|	ВыплаченнаяЗарплатаОбороты.ФизЛицо КАК ФизЛицо,
		|	ВыплаченнаяЗарплатаОбороты.СуммаОборот КАК СуммаВыплаты
		|ИЗ
		|	РегистрНакопления.ВыплаченнаяЗарплата.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Авто,
		|			Организация = &Организация
		|				И ФизЛицо = &ФизЛицо) КАК ВыплаченнаяЗарплатаОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО ВыплаченнаяЗарплатаОбороты.Организация = ДанныеПервичныхДокументов.Организация
		|			И ВыплаченнаяЗарплатаОбороты.Регистратор = ДанныеПервичныхДокументов.Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СотрудникиСрезПоследних.Подразделение В ИЕРАРХИИ (&Подразделение)", "ИСТИНА");	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Начисления.ФизЛицо = &ФизЛицо", "ИСТИНА");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Удержания.ФизЛицо = &ФизЛицо", "ИСТИНА");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Субконто1 = &ФизЛицо", "ИСТИНА");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ФизЛицо = &ФизЛицо", "ИСТИНА");	
	КонецЕсли;	
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", ПериодРегистрации);	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ФизЛицо", Сотрудник);
	Запрос.УстановитьПараметр("ВидыРасчетовИсключения", ВидыРасчетовИсключения);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат РезультатЗапроса;

КонецФункции // ВыполнитьЗапрос()

// Процедура формирует отчет.
//
Процедура СформироватьВыполнить(ПараметрыОтчета, ТабличныйДокумент)
	
	ПериодРегистрации 	= ПараметрыОтчета.ПериодРегистрации;
	Организация 		= ПараметрыОтчета.Организация;
	
	РезультатЗапроса = ВыполнитьЗапрос(ПараметрыОтчета);

	Если РезультатЗапроса[0].Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'Нет данных для формирования отчета.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	Макет = Отчеты.РасчетныеЛистки.ПолучитьМакет("Макет");

	ОбластьШапка 				= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок 			= Макет.ПолучитьОбласть("Заголовок");
	ОбластьНачисленоУдержано 	= Макет.ПолучитьОбласть("НачисленоУдержано");
	ОбластьДетали 				= Макет.ПолучитьОбласть("Детали");
	ОбластьДопдоход 			= Макет.ПолучитьОбласть("Допдоход");
	ОбластьДеталиДопдоход 		= Макет.ПолучитьОбласть("ДеталиДопдоход");
	ОбластьДоходыВыплачено 		= Макет.ПолучитьОбласть("ДоходыВыплачено");
	ОбластьДеталиВыплаты 		= Макет.ПолучитьОбласть("ДеталиВыплаты");
	ОбластьВсего 				= Макет.ПолучитьОбласть("Всего");
	ОбластьВсегоВыплачено 		= Макет.ПолучитьОбласть("ВсегоВыплачено");
	ОбластьПодвал 				= Макет.ПолучитьОбласть("Подвал");
	ОбластьОтбивка 				= Макет.ПолучитьОбласть("Отбивка");
	ОбластьПодпись 				= Макет.ПолучитьОбласть("Подпись");

	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ОбластьОтбивка.Параметры.ТекстОтбивки = Формат(ПериодРегистрации , "ДФ=""ММММ гггг 'г.' """);
	ТабличныйДокумент.Вывести(ОбластьОтбивка);
	
	Если ПолучитьФункциональнуюОпцию("УчетПоНесколькимОрганизациям") Тогда 
		ОбластьОтбивка.Параметры.ТекстОтбивки = "Организация: " + Организация;
		ТабличныйДокумент.Вывести(ОбластьОтбивка);
	КонецЕсли;	

	ТаблицаНачисленоУдержано = РезультатЗапроса[1].Выгрузить();
	ТаблицаНачисленоУдержано.Индексы.Добавить("ФизЛицо");
	
	ТаблицаВыплачено = РезультатЗапроса[2].Выгрузить();
	ТаблицаВыплачено.Индексы.Добавить("ФизЛицо");
	
	ВыборкаПодразделение = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	Пока ВыборкаПодразделение.Следующий() Цикл

        ОбластьОтбивка.Параметры.ТекстОтбивки = "Подразделение: " + ВыборкаПодразделение.Подразделение;
		ТабличныйДокумент.Вывести(ОбластьОтбивка);
        ТабличныйДокумент.НачатьГруппуСтрок();
		
		ВыборкаФизЛицо = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизЛицо");
		Пока ВыборкаФизЛицо.Следующий() Цикл

			СтруктураПоискиПоВыборкей		 = Новый Структура("ФизЛицо", ВыборкаФизЛицо.ФизЛицо);
			НайденныеСтрокиНачисленоУдержано = ТаблицаНачисленоУдержано.НайтиСтроки(СтруктураПоискиПоВыборкей);
			НайденныеСтрокиВыплачено	   	 = ТаблицаВыплачено.НайтиСтроки(СтруктураПоискиПоВыборкей);

			// Выводим расч листочек по ФЛ, если есть суммы
			Если ВыборкаФизЛицо.СальдоНаНачало = 0 И ВыборкаФизЛицо.СальдоНаКонец = 0
				И НайденныеСтрокиНачисленоУдержано.Количество() = 0 
				И НайденныеСтрокиВыплачено.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;

			ОбластьШапка.Параметры.Заголовок = "Расчетный листок за " + Формат(ПериодРегистрации , "ДФ=""ММММ гггг 'г.' """);
			ОбластьШапка.Параметры.Организация = Организация;
			ОбластьШапка.Параметры.Заполнить(ВыборкаФизЛицо);
			ПредставлениеФизЛицо = БухгалтерскийУчетСервер.ПолучитьФамилиюИмяОтчество(ВыборкаФизЛицо.Фамилия, ВыборкаФизЛицо.Имя, ВыборкаФизЛицо.Отчество, Истина);
			ОбластьШапка.Параметры.ФизЛицо = ?(ЗначениеЗаполнено(ПредставлениеФизЛицо), ПредставлениеФизЛицо, ВыборкаФизЛицо.ФизЛицо);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			ТабличныйДокумент.Вывести(ОбластьНачисленоУдержано);

			ПоследнееНачисление = ТабличныйДокумент.ВысотаТаблицы;
			ПоследнееУдержание = ТабличныйДокумент.ВысотаТаблицы;
			
			// Начисление / удержание
			ВсегоНачисления = 0;
			ВсегоУдержания = 0;
			
			МассивТиповНачислений = Новый Массив;
			МассивТиповНачислений.Добавить(Тип("ПланВидовРасчетаСсылка.ВидыНачислений"));
			
			ТЗДопдоходы = Новый ТаблицаЗначений; 
			ТЗДопдоходы.Колонки.Добавить("Начисление", 		Новый ОписаниеТипов(МассивТиповНачислений));
			ТЗДопдоходы.Колонки.Добавить("ДатаНачала", 		ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			ТЗДопдоходы.Колонки.Добавить("ДатаОкончания", 	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			ТЗДопдоходы.Колонки.Добавить("ОтработаноДней", 	ОбщегоНазначения.ОписаниеТипаЧисло(7,2));
			ТЗДопдоходы.Колонки.Добавить("ОтработаноЧасов", ОбщегоНазначения.ОписаниеТипаЧисло(7,2));
			ТЗДопдоходы.Колонки.Добавить("Допдоход", 		ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
			
			//СтруктураПоискиПоВыборкей = Новый Структура("ФизЛицо", ВыборкаФизЛицо.ФизЛицо);
			//НайденныеСтроки = ТаблицаНачисленоУдержано.НайтиСтроки(СтруктураПоискиПоВыборкей);
			НайденныеСтроки = НайденныеСтрокиНачисленоУдержано;

			Для Каждого НайденнаяСтрокаНачислениеУдержание Из НайденныеСтроки Цикл 
			
				Если НайденнаяСтрокаНачислениеУдержание.Удержание = NULL Тогда
					
					Если НайденнаяСтрокаНачислениеУдержание.СуммаНачислено <> 0 Тогда
					
						Если ПоследнееНачисление < ПоследнееУдержание Тогда
							
							ТабличныйДокумент.Область(ПоследнееНачисление + 1, 1).Текст = НайденнаяСтрокаНачислениеУдержание.Начисление;
							ТабличныйДокумент.Область(ПоследнееНачисление + 1, 2, ПоследнееНачисление + 1, 3).Текст = "" + День(НайденнаяСтрокаНачислениеУдержание.ДатаНачала) + "-" + День(НайденнаяСтрокаНачислениеУдержание.ДатаОкончания) + " " + Формат(НайденнаяСтрокаНачислениеУдержание.ДатаОкончания , "ДФ=""МММ гг""");
							ТабличныйДокумент.Область(ПоследнееНачисление + 1, 4).Текст = НайденнаяСтрокаНачислениеУдержание.ОтработаноДней;
							ТабличныйДокумент.Область(ПоследнееНачисление + 1, 5).Текст = НайденнаяСтрокаНачислениеУдержание.ОтработаноЧасов;
							ТабличныйДокумент.Область(ПоследнееНачисление + 1, 6, ПоследнееНачисление + 1, 7).Текст = НайденнаяСтрокаНачислениеУдержание.СуммаНачислено;
						
						Иначе
						
							ОбластьДетали.Параметры.Начисление = НайденнаяСтрокаНачислениеУдержание.Начисление;
							ОбластьДетали.Параметры.ПериодНачисление = "" + День(НайденнаяСтрокаНачислениеУдержание.ДатаНачала) + "-" + День(НайденнаяСтрокаНачислениеУдержание.ДатаОкончания) + " " + Формат(НайденнаяСтрокаНачислениеУдержание.ДатаОкончания , "ДФ=""МММ гг""");
							ОбластьДетали.Параметры.ОтработаноДнейНачисление = НайденнаяСтрокаНачислениеУдержание.ОтработаноДней;
							ОбластьДетали.Параметры.ОтработаноЧасовНачисление = НайденнаяСтрокаНачислениеУдержание.ОтработаноЧасов;
							ОбластьДетали.Параметры.СуммаНачисление = НайденнаяСтрокаНачислениеУдержание.СуммаНачислено;
							
							ТабличныйДокумент.Вывести(ОбластьДетали);
							
							ОбластьДетали.Параметры.Начисление = ПланыВидовРасчета.ВидыНачислений.ПустаяСсылка();
							ОбластьДетали.Параметры.ПериодНачисление = "";
							ОбластьДетали.Параметры.ОтработаноДнейНачисление = 0;
							ОбластьДетали.Параметры.ОтработаноЧасовНачисление = 0;
							ОбластьДетали.Параметры.СуммаНачисление = 0;
						
						КонецЕсли; 
						
						ПоследнееНачисление = ПоследнееНачисление + 1;
						
					Иначе
						СтрокаТаблицы = ТЗДопдоходы.Добавить();
						СтрокаТаблицы.Начисление 		= НайденнаяСтрокаНачислениеУдержание.Начисление;
						СтрокаТаблицы.ДатаНачала 		= НайденнаяСтрокаНачислениеУдержание.ДатаНачала;
						СтрокаТаблицы.ДатаОкончания 	= НайденнаяСтрокаНачислениеУдержание.ДатаОкончания;
						СтрокаТаблицы.ОтработаноДней 	= НайденнаяСтрокаНачислениеУдержание.ОтработаноДней;
						СтрокаТаблицы.ОтработаноЧасов 	= НайденнаяСтрокаНачислениеУдержание.ОтработаноЧасов;
						СтрокаТаблицы.Допдоход 			= НайденнаяСтрокаНачислениеУдержание.Допдоход;
					КонецЕсли;
					
				Иначе
					
					Если ПоследнееУдержание < ПоследнееНачисление Тогда
					
						ТабличныйДокумент.Область(ПоследнееУдержание + 1, 8, ПоследнееУдержание + 1, 10).Текст = НайденнаяСтрокаНачислениеУдержание.Удержание;	
						ТабличныйДокумент.Область(ПоследнееУдержание + 1, 11, ПоследнееУдержание + 1, 12).Текст = Формат(НайденнаяСтрокаНачислениеУдержание.ДатаОкончания , "ДФ=""МММ гг""");
						ТабличныйДокумент.Область(ПоследнееУдержание + 1, 13, ПоследнееУдержание + 1, 14).Текст = НайденнаяСтрокаНачислениеУдержание.СуммаУдержано;
					
					Иначе
					
						ОбластьДетали.Параметры.Удержание = НайденнаяСтрокаНачислениеУдержание.Удержание;
						ОбластьДетали.Параметры.ПериодУдержание = Формат(НайденнаяСтрокаНачислениеУдержание.ДатаОкончания , "ДФ=""МММ гг""");
						ОбластьДетали.Параметры.СуммаУдержание = НайденнаяСтрокаНачислениеУдержание.СуммаУдержано;
						
						ТабличныйДокумент.Вывести(ОбластьДетали);
						
						ОбластьДетали.Параметры.Удержание = ПланыВидовРасчета.ВидыУдержаний.ПустаяСсылка();
						ОбластьДетали.Параметры.ПериодУдержание = "";
						ОбластьДетали.Параметры.СуммаУдержание = 0;
					
					КонецЕсли; 
					
					ПоследнееУдержание = ПоследнееУдержание + 1;
				
				КонецЕсли; 
				
				ВсегоНачисления = ВсегоНачисления + НайденнаяСтрокаНачислениеУдержание.СуммаНачислено;
				ВсегоУдержания = ВсегоУдержания + НайденнаяСтрокаНачислениеУдержание.СуммаУдержано;
			КонецЦикла;

			ТабличныйДокумент.Вывести(ОбластьДопдоход);
			
			// Вывести дополнительный доход.
			Для Каждого СтрокаТаблицы Из ТЗДопдоходы Цикл
				
				ОбластьДеталиДопдоход.Параметры.Начисление = СтрокаТаблицы.Начисление;
				ОбластьДеталиДопдоход.Параметры.ПериодНачисление = "" + День(СтрокаТаблицы.ДатаНачала) + "-" + День(СтрокаТаблицы.ДатаОкончания) + " " + Формат(СтрокаТаблицы.ДатаОкончания , "ДФ=""МММ гг""");
				ОбластьДеталиДопдоход.Параметры.ОтработаноДнейНачисление = СтрокаТаблицы.ОтработаноДней;
				ОбластьДеталиДопдоход.Параметры.ОтработаноЧасовНачисление = СтрокаТаблицы.ОтработаноЧасов;
				ОбластьДеталиДопдоход.Параметры.СуммаНачисление = СтрокаТаблицы.Допдоход;
				
				ТабличныйДокумент.Вывести(ОбластьДеталиДопдоход);
				
				ОбластьДеталиДопдоход.Параметры.Начисление = ПланыВидовРасчета.ВидыНачислений.ПустаяСсылка();
				ОбластьДеталиДопдоход.Параметры.ПериодНачисление = "";
				ОбластьДеталиДопдоход.Параметры.ОтработаноДнейНачисление = 0;
				ОбластьДеталиДопдоход.Параметры.ОтработаноЧасовНачисление = 0;
				ОбластьДеталиДопдоход.Параметры.СуммаНачисление = 0;
				
				//ВсегоНачисления = ВсегоНачисления + СтрокаТаблицы.Допдоход;
			КонецЦикла;	
			
			ОбластьВсего.Параметры.ВсегоНачисления = ВсегоНачисления;
			ОбластьВсего.Параметры.ВсегоУдержания = ВсегоУдержания;
			ТабличныйДокумент.Вывести(ОбластьВсего);
			
			// Выплачено
			ТабличныйДокумент.Вывести(ОбластьДоходыВыплачено);
			//ВыборкаВыплатСотрудника = РезультатЗапроса[2].Выбрать();
			
			//СтруктураПоискиПоВыборкей = Новый Структура("ФизЛицо", ВыборкаФизЛицо.ФизЛицо);
			//НайденныеСтроки = ТаблицаВыплачено.НайтиСтроки(СтруктураПоискиПоВыборкей);
			НайденныеСтроки = НайденныеСтрокиВыплачено;
			ВсегоВыплачено = 0;
			
			Для Каждого НайденнаяСтрокаВыплачено Из НайденныеСтроки Цикл
				
				ОбластьДеталиВыплаты.Параметры.Заполнить(НайденнаяСтрокаВыплачено);
				ОбластьДеталиВыплаты.Параметры.ТекстВыплаты = "" + НайденнаяСтрокаВыплачено.ПредставлениеДокумента 
				+ ?(НайденнаяСтрокаВыплачено.ПризнакАванса, "(аванс) №", " №") + 
				СокрЛП(НайденнаяСтрокаВыплачено.Номер) + " от " + Формат(НайденнаяСтрокаВыплачено.Дата, "ДЛФ=D");
				
				Если НайденнаяСтрокаВыплачено.ПризнакАванса Тогда 
					ОбластьДеталиВыплаты.Параметры.ПериодВыплат = Формат(НайденнаяСтрокаВыплачено.Дата, "ДФ=""МММ гг""");
				Иначе 
					ОбластьДеталиВыплаты.Параметры.ПериодВыплат = Формат(НайденнаяСтрокаВыплачено.ПериодРегистрации, "ДФ=""МММ гг""");
				КонецЕсли;	
				
				ТабличныйДокумент.Вывести(ОбластьДеталиВыплаты);
				
				ВсегоВыплачено = ВсегоВыплачено + НайденнаяСтрокаВыплачено.СуммаВыплаты;
				
			КонецЦикла;
			
			ОбластьВсегоВыплачено.Параметры.ВсегоВыплачено = ВсегоВыплачено;
			ТабличныйДокумент.Вывести(ОбластьВсегоВыплачено);
			
			Если ВыборкаФизЛицо.СальдоНаНачало < 0 Тогда
				ОбластьПодвал.Параметры.ТекстДолгНаНачалоПериода = "Долг за работником на начало месяца:";
				СальдоНаНачало = ВыборкаФизЛицо.СальдоНаНачало * (-1);
			Иначе	
				ОбластьПодвал.Параметры.ТекстДолгНаНачалоПериода = "Долг за организацией на начало месяца:";
				СальдоНаНачало = ВыборкаФизЛицо.СальдоНаНачало;
			КонецЕсли; 
			
			Если ВыборкаФизЛицо.СальдоНаКонец < 0 Тогда
				ОбластьПодвал.Параметры.ТекстДолгНаКонецПериода = "Долг за работником на конец месяца:";
				СальдоНаКонец = ВыборкаФизЛицо.СальдоНаКонец * (-1);
			Иначе	
				ОбластьПодвал.Параметры.ТекстДолгНаКонецПериода = "Долг за организацией на конец месяца:";
				СальдоНаКонец = ВыборкаФизЛицо.СальдоНаКонец;
			КонецЕсли;
			
			ОбластьПодвал.Параметры.СуммаДолгНаНачалоПериода = СальдоНаНачало;
			ОбластьПодвал.Параметры.СуммаДолгНаКонецПериода = СальдоНаКонец;

			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			Если ПараметрыОтчета.ВывестиПодпись Тогда 
				ТабличныйДокумент.Вывести(ОбластьПодпись);
			КонецЕсли;
			
		КонецЦикла;

        ТабличныйДокумент.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;

КонецПроцедуры // Сформировать()

#КонецОбласти

#КонецЕсли
